tutorials/multiphase/reactingTwoPhaseEulerFoam/RAS/bubbleColumnEvaporatingReacting/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          25;
        startFace       3650;
    }
    outlet
    {
        type            patch;
        nFaces          25;
        startFace       3675;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          150;
        startFace       3700;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3750;
        startFace       3850;
    }
)

// ************************************************************************* //
